#### Задание 1

Импортируйте библиотеку Pandas и дайте ей псевдоним pd. Создайте датафрейм authors со столбцами author_id и author_name, в которых соответственно содержатся данные: [1, 2, 3] и ['Тургенев', 'Чехов', 'Островский'].
Затем создайте датафрейм book cо столбцами author_id, book_title и price, в которых соответственно содержатся данные:  
[1, 1, 1, 2, 2, 3, 3],
['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
[450, 300, 350, 500, 450, 370, 290].

In [1]:
import pandas as pd
from IPython.display import display

In [2]:
authors = pd.DataFrame({
    'author_id': [1, 2, 3],
    'author_name': ['Turgenev', 'Chechov', 'Ostrovsky'],
})

In [3]:
display(authors)

   author_id author_name
0          1    Turgenev
1          2     Chechov
2          3   Ostrovsky

In [4]:
books = pd.DataFrame({
    'author_id': [1, 1, 1, 2, 2, 3, 3],
    'book_title': ['Fathers and Children', 
                   'Rudin', 
                   'Noble Nest', 
                   'Fat and Thin', 
                   'Lady with a Dog', 
                   'Thunderstorm', 
                   'Talents and Fans'],
    'price': [450, 300, 350, 500, 450, 370, 290]
})

In [5]:
display(books)

   author_id            book_title  price
0          1  Fathers and Children    450
1          1                 Rudin    300
2          1            Noble Nest    350
3          2          Fat and Thin    500
4          2       Lady with a Dog    450
5          3          Thunderstorm    370
6          3      Talents and Fans    290

#### Задание 2

Получите датафрейм authors_price, соединив датафреймы authors и books по полю author_id.

In [6]:
authors_price = pd.merge(authors, books, on='author_id', how='inner')

In [7]:
display(authors_price)

   author_id author_name            book_title  price
0          1    Turgenev  Fathers and Children    450
1          1    Turgenev                 Rudin    300
2          1    Turgenev            Noble Nest    350
3          2     Chechov          Fat and Thin    500
4          2     Chechov       Lady with a Dog    450
5          3   Ostrovsky          Thunderstorm    370
6          3   Ostrovsky      Talents and Fans    290

#### Задание 3

Создайте датафрейм top5, в котором содержатся строки из authors_price с пятью самыми дорогими книгами.

In [8]:
top5 = authors_price.sort_values(by = 'price', ascending = False).head(5)

In [9]:
display(top5)

   author_id author_name            book_title  price
3          2     Chechov          Fat and Thin    500
0          1    Turgenev  Fathers and Children    450
4          2     Chechov       Lady with a Dog    450
5          3   Ostrovsky          Thunderstorm    370
2          1    Turgenev            Noble Nest    350

#### Задание 4

Создайте датафрейм authors_stat на основе информации из authors_price. В датафрейме authors_stat должны быть четыре столбца:
author_name, min_price, max_price и mean_price,
в которых должны содержаться соответственно имя автора, минимальная, максимальная и средняя цена на книги этого автора.

In [10]:
authors_stat = pd.DataFrame()

In [11]:
authors_stat['min_price'] = authors_price.groupby('author_name')['price'].min()

authors_stat['max_price'] = authors_price.groupby('author_name')['price'].max()

authors_stat['mean_price'] = authors_price.groupby('author_name')['price'].mean()

authors_stat.reset_index(inplace=True)

In [12]:
display(authors_stat)

  author_name  min_price  max_price  mean_price
0     Chechov        450        500  475.000000
1   Ostrovsky        290        370  330.000000
2    Turgenev        300        450  366.666667

#### Задание 5**

Создайте новый столбец в датафрейме authors_price под названием cover, в нем будут располагаться данные о том, какая обложка у данной книги - твердая или мягкая. В этот столбец поместите данные из следующего списка:
['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая'].

Просмотрите документацию по функции pd.pivot_table с помощью вопросительного знака.Для каждого автора посчитайте суммарную стоимость книг в твердой и мягкой обложке. Используйте для этого функцию pd.pivot_table. При этом столбцы должны называться "твердая" и "мягкая", а индексами должны быть фамилии авторов. Пропущенные значения стоимостей заполните нулями, при необходимости загрузите библиотеку Numpy.

Назовите полученный датасет book_info и сохраните его в формат pickle под названием "book_info.pkl". Затем загрузите из этого файла датафрейм и назовите его book_info2. Удостоверьтесь, что датафреймы book_info и book_info2 идентичны.

In [13]:
authors_price['cover'] = ['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая']

In [14]:
display(authors_price)

   author_id author_name            book_title  price    cover
0          1    Turgenev  Fathers and Children    450  твердая
1          1    Turgenev                 Rudin    300   мягкая
2          1    Turgenev            Noble Nest    350   мягкая
3          2     Chechov          Fat and Thin    500  твердая
4          2     Chechov       Lady with a Dog    450  твердая
5          3   Ostrovsky          Thunderstorm    370   мягкая
6          3   Ostrovsky      Talents and Fans    290   мягкая

In [15]:
book_info = authors_price.pivot_table(index = 'author_name', columns = 'cover', values = 'price', aggfunc = 'sum').fillna('0')

In [16]:
display(book_info)

cover       мягкая твердая
author_name
Chechov          0     950
Ostrovsky      660       0
Turgenev       650     450

In [17]:
book_info.to_pickle("book_info.pkl")

In [18]:
book_info2 = pd.read_pickle("book_info.pkl")

In [19]:
display('book_info', book_info, 'book_info2', book_info2)

'book_info'

cover       мягкая твердая
author_name
Chechov          0     950
Ostrovsky      660       0
Turgenev       650     450

'book_info2'

cover       мягкая твердая
author_name
Chechov          0     950
Ostrovsky      660       0
Turgenev       650     450